{
  "backend/main.mo": "Motoko canister storing enquiries with submit, list, and lookup functions using a map and timestamps.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all major frontend React components, data files, hooks, and configuration.",
  "frontend/index.css": "Tailwind base stylesheet defining global color variables, dark mode overrides, and applying background/foreground styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component managing category and location state and rendering site sections with header and footer.",
  "frontend/src/components/enquiry/EnquiryForm.tsx": "Form component that validates input, builds contextual enquiry messages, and submits them via React Query with success/error UI.",
  "frontend/src/components/enquiry/EnquirySection.tsx": "Section combining static contact information with the enquiry form.",
  "frontend/src/components/projects/CategoryToggle.tsx": "Toggle UI for switching between Residential and Commercial categories.",
  "frontend/src/components/projects/LocationFilter.tsx": "Filter UI for selecting or clearing a project location from predefined options.",
  "frontend/src/components/projects/ProjectCard.tsx": "Displays a project’s image, details, category badge, and optional status.",
  "frontend/src/components/projects/ProjectsList.tsx": "Renders a grid of project cards or an empty state when no projects match.",
  "frontend/src/components/projects/ProjectsSection.tsx": "Renders the projects section with category and location filters, displaying a filtered project list.",
  "frontend/src/components/site/Footer.tsx": "Displays the site footer with logo, location links, social icons, and dynamic year attribution.",
  "frontend/src/components/site/Header.tsx": "Provides a sticky header with navigation buttons that scroll to site sections and an enquiry call-to-action.",
  "frontend/src/components/site/HeroSection.tsx": "Renders the hero banner with background image, intro text, feature highlights, and navigation buttons.",
  "frontend/src/data/sampleProjects.ts": "Defines the Project interface and exports sample project data for display and filtering.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, invalidating related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides a mutation hook for submitting enquiries via the backend actor and invalidates related queries.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode values, and global styles.",
  "frontend/src/lib/assetPaths.ts": "Builds asset URLs safely using the app's base path to avoid incorrect paths in production.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, container settings, and includes typography, container-queries, and animate plugins.",
  "project_state.json": "Describes project metadata for a real estate website, including features, known logo issue, requirements, and current project state."
}